from locale import DAY_1
import matplotlib.pyplot as plt
import japanize_matplotlib
import numpy as np

s = [10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000]
d1 = [0.2260117000, 0.9655768000, 2.2342854000, 4.0450993000, 6.3973330000, 9.3136126000, 12.7082773000, 16.6920109000, 21.2206023000, 26.2918089000] 
d2 = [0.2241221000, 0.9612700000, 2.2250278000, 4.0435996000, 6.4200085000, 9.3856766000, 12.8328391000, 16.7945821000, 21.3098139000, 26.3672766000] 
d3 = [0.2248952000, 0.9691409000, 2.2356220000, 4.0668272000, 6.4282715000, 9.3043659000, 12.7487501000, 16.8854062000, 21.3037565000, 26.3093366000] 
d4 = [0.1003952000, 0.4013098000, 0.9034636000, 1.6063227000, 2.5100585000, 3.6149002000, 4.9265654000, 6.4359751000, 8.1389066000, 10.0458130000] 
d5 = [0.1825856000, 0.7325157000, 1.6466966000, 2.9312789000, 4.5839558000, 6.6514620000, 8.9976576000, 11.7368752000, 14.9503849000, 18.4367828000] 
d6 = [0.1420277000, 0.5691848000, 1.2834398000, 2.2786255000, 3.5590651000, 5.1218965000, 6.9746872000, 9.1096530000, 11.5236725000, 14.2316616000]
d7 = [0.2100893000, 0.8900537000, 2.0353642000, 3.6514843000, 5.7496999000, 8.2949875000, 11.3313599000, 14.9190211000, 18.8371882000, 23.2754890000] 

x = np.array(s)
y1 = np.array(d1)
y2 = np.array(d2)
y3 = np.array(d3)
y4 = np.array(d4)
y5 = np.array(d5)
y6 = np.array(d6)
y7 = np.array(d7)

plt.grid(True)
# plt.tick_params(labelsize = 10) # 目盛線ラベルサイズ

# グラフ描画
plt.plot(x, y1, color='b', marker="o", markeredgewidth=1, label="data1.dat (ランダムデータ)")
plt.plot(x, y2, color='r', marker="o", markeredgewidth=1, label="data2.dat (ランダムデータ)")
plt.plot(x, y3, color='y', marker="o", markeredgewidth=1, label="data3.dat (ランダムデータ)")
plt.plot(x, y4, color='g', marker="o", markeredgewidth=1, label="data4.dat (昇順データ)")
plt.plot(x, y5, color='k', marker="o", markeredgewidth=1, label="data5.dat (降順データ)")
plt.plot(x, y6, color='m', marker="o", markeredgewidth=1, label="data6.dat (バイトニックデータ)")
plt.plot(x, y7, color='c', marker="o", markeredgewidth=1, label="data7.dat (ジグザグデータ)")

plt.legend(loc="upper left", fontsize=15) # (3)凡例表示
# plt.xticks(x, ["0.0234375", "0.046875", "0.09375", "0.1875", "0.375", "0.75"])

plt.xlabel("データ数 [個]") # x軸ラベル
plt.ylabel("実行時間 [s]") # y軸ラベル

plt.show()
